/**
 * 현금으로 돈을 받고 25000원을 거슬러 주어야 합니다
 * 5만원 짜리는 몇장, 만원짜리는 몇장, 5천원짜리는 몇장을 거슬러주어야 할까요?
 */
class CorrencyCount {
    public static void main(String[] args) {

        //배열 arr에 50000원부터 10원까지
        int[] arr = new int[]{50000, 10000, 5000, 1000, 500, 100, 50, 10}; //arr의 축약형

        /**
         *         arr[0] = 50000;
         *         arr[1] = 10000;
         *         arr[2] = 5000;
         *         arr[3] = 1000;
         *         arr[4] = 500;
         *         arr[5] = 100;
         *         arr[6] = 50;
         *         arr[7] = 10;
         */








    }
}